<script setup>
import { helper } from '@/composables/helper.js'
const { route } = helper();

import { api } from '@/composables/api.js';
const { sendApiRequest } = api();

const props = defineProps({
	userName: {
		type: String,
		default: null,
	},
});

</script>

<template>
	<div class="item-box">
		Мы являемся не коммерческим проектов. У нас нет рекламы, спонсоров или какого-то иного материального дохода от проекта.<br />
		Весь проект держится на энтузиазме.<br />
		Но сам проект материально зависит, так как требует оплаты сервера, домена, ресурсов использумых для разработки и хранения данных.<br />
		Если у Вас есть желание и возможность поддержать проект материально, воспользуйтесь ссылкой на донат.<br />
		В благодарность пользователям, которые поддержали ивент на сумму 300 рублей или больше мы выдаем премиум доступ, в рамках текущего ивета.<br />

		Премиум доступ дает следующие возможности:
		- Установка анимированной рамки аватара, с возможностью выбора цвета анимации
		- Смена фонового изображения профайла
		- Установка премиум сообщения, которые могут увидеть другие игроки
		- Возможность добавить свои игры в ивент, до выполнения условий необходимых для добавления игр

		Премиум доступ действует до окончания текущего ивента.
	</div>
</template>

<style lang="scss" scoped>
.item-box {
	@apply rounded-none;
}
</style>
